Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/edc/ATSAMS70J19B.PIC
      <edc:SFRDef edc:_addr="0x4003819C" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_DEVEPTIFR3" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:desc="Transmitted IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:desc="Received OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPIS" edc:desc="Received SETUP Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTIS" edc:desc="NAKed OUT Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINIS" edc:desc="NAKed IN Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDIS" edc:desc="STALLed Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Interrupt Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381A0" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_DEVEPTIFR4" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:desc="Transmitted IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:desc="Received OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPIS" edc:desc="Received SETUP Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTIS" edc:desc="NAKed OUT Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINIS" edc:desc="NAKed IN Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDIS" edc:desc="STALLed Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Interrupt Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381A4" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_DEVEPTIFR5" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:desc="Transmitted IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:desc="Received OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPIS" edc:desc="Received SETUP Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTIS" edc:desc="NAKed OUT Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINIS" edc:desc="NAKed IN Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDIS" edc:desc="STALLed Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Interrupt Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381A8" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_DEVEPTIFR6" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:desc="Transmitted IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:desc="Received OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPIS" edc:desc="Received SETUP Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTIS" edc:desc="NAKed OUT Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINIS" edc:desc="NAKed IN Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDIS" edc:desc="STALLed Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Interrupt Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381AC" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_DEVEPTIFR7" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:desc="Transmitted IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:desc="Received OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPIS" edc:desc="Received SETUP Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTIS" edc:desc="NAKed OUT Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINIS" edc:desc="NAKed IN Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDIS" edc:desc="STALLed Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Interrupt Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381B0" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_DEVEPTIFR8" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:desc="Transmitted IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:desc="Received OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPIS" edc:desc="Received SETUP Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTIS" edc:desc="NAKed OUT Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINIS" edc:desc="NAKed IN Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDIS" edc:desc="STALLed Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Interrupt Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381B4" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_DEVEPTIFR9" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:desc="Transmitted IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:desc="Received OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPIS" edc:desc="Received SETUP Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTIS" edc:desc="NAKed OUT Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINIS" edc:desc="NAKed IN Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDIS" edc:desc="STALLed Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Interrupt Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400381B8" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x400381C0" edc:access="------------rrrr-rrr----rrrrrrrr" edc:cname="USBHS_DEVEPTIMR0" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINE" edc:desc="Transmitted IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTE" edc:desc="Received OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPE" edc:desc="Received SETUP Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTE" edc:desc="NAKed OUT Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINE" edc:desc="NAKed IN Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFE" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDE" edc:desc="STALLed Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETE" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:desc="Number of Busy Banks Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBK" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMA" edc:desc="Endpoint Interrupts Disable HDMA Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDIS" edc:desc="NYET Token Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:desc="Reset Data Toggle" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ" edc:desc="STALL Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381C4" edc:access="------------rrrr-rrr----rrrrrrrr" edc:cname="USBHS_DEVEPTIMR1" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINE" edc:desc="Transmitted IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTE" edc:desc="Received OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPE" edc:desc="Received SETUP Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTE" edc:desc="NAKed OUT Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINE" edc:desc="NAKed IN Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFE" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDE" edc:desc="STALLed Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETE" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:desc="Number of Busy Banks Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBK" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMA" edc:desc="Endpoint Interrupts Disable HDMA Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDIS" edc:desc="NYET Token Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:desc="Reset Data Toggle" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ" edc:desc="STALL Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381C8" edc:access="------------rrrr-rrr----rrrrrrrr" edc:cname="USBHS_DEVEPTIMR2" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINE" edc:desc="Transmitted IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTE" edc:desc="Received OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPE" edc:desc="Received SETUP Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTE" edc:desc="NAKed OUT Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINE" edc:desc="NAKed IN Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFE" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDE" edc:desc="STALLed Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETE" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:desc="Number of Busy Banks Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBK" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMA" edc:desc="Endpoint Interrupts Disable HDMA Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDIS" edc:desc="NYET Token Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:desc="Reset Data Toggle" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ" edc:desc="STALL Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381CC" edc:access="------------rrrr-rrr----rrrrrrrr" edc:cname="USBHS_DEVEPTIMR3" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINE" edc:desc="Transmitted IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTE" edc:desc="Received OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPE" edc:desc="Received SETUP Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTE" edc:desc="NAKed OUT Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINE" edc:desc="NAKed IN Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFE" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDE" edc:desc="STALLed Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETE" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:desc="Number of Busy Banks Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBK" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMA" edc:desc="Endpoint Interrupts Disable HDMA Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDIS" edc:desc="NYET Token Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:desc="Reset Data Toggle" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ" edc:desc="STALL Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381D0" edc:access="------------rrrr-rrr----rrrrrrrr" edc:cname="USBHS_DEVEPTIMR4" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINE" edc:desc="Transmitted IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTE" edc:desc="Received OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPE" edc:desc="Received SETUP Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTE" edc:desc="NAKed OUT Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINE" edc:desc="NAKed IN Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFE" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDE" edc:desc="STALLed Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETE" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:desc="Number of Busy Banks Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBK" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMA" edc:desc="Endpoint Interrupts Disable HDMA Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDIS" edc:desc="NYET Token Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:desc="Reset Data Toggle" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ" edc:desc="STALL Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381D4" edc:access="------------rrrr-rrr----rrrrrrrr" edc:cname="USBHS_DEVEPTIMR5" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINE" edc:desc="Transmitted IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTE" edc:desc="Received OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPE" edc:desc="Received SETUP Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTE" edc:desc="NAKed OUT Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINE" edc:desc="NAKed IN Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFE" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDE" edc:desc="STALLed Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETE" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:desc="Number of Busy Banks Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBK" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMA" edc:desc="Endpoint Interrupts Disable HDMA Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDIS" edc:desc="NYET Token Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:desc="Reset Data Toggle" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ" edc:desc="STALL Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381D8" edc:access="------------rrrr-rrr----rrrrrrrr" edc:cname="USBHS_DEVEPTIMR6" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINE" edc:desc="Transmitted IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTE" edc:desc="Received OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPE" edc:desc="Received SETUP Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTE" edc:desc="NAKed OUT Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINE" edc:desc="NAKed IN Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFE" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDE" edc:desc="STALLed Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETE" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:desc="Number of Busy Banks Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBK" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMA" edc:desc="Endpoint Interrupts Disable HDMA Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDIS" edc:desc="NYET Token Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:desc="Reset Data Toggle" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ" edc:desc="STALL Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
